МПР/src/Documents/ds_СверкаДенежныхСредств/ds_СверкаДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ds_СверкаДенежныхСредств</name>
  <posting>Deny</posting>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаХОтчет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВедомостьДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДенежныеСредства</name>
    <attributes>
      <name>ДенежныйЗнак</name>
      <type>
        <types>CatalogRef.ds_ДенежныеЗнаки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/Catalogs/ds_ДенежныеЗнаки/ds_ДенежныеЗнаки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ds_ДенежныеЗнаки</name>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ds_ВидыДенежныхЗнаков</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

МПР/src/Documents/ds_СверкаДенежныхСредств/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ds_ДенежныеЗнаки.Ссылка КАК ДенежныйЗнак,
		|	ds_ДенежныеЗнаки.Вид
		|ИЗ
		|	Справочник.ds_ДенежныеЗнаки КАК ds_ДенежныеЗнаки
		|ГДЕ
		|	ds_ДенежныеЗнаки.Использовать
		|
		|УПОРЯДОЧИТЬ ПО
		|	ds_ДенежныеЗнаки.Номинал";
		ЭтотОбъект.ДенежныеСредства.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ds_ОбщегоНазначенияВызовСервера.РольДоступнаТекущемуПользователю("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСредстваПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ОбщегоНазначенияРТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.ДенежныйЗнак, "Номинал");
	Объект.Сумма = Объект.ДенежныеСредства.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

#КонецОбласти
